{
  "common": {
    "toolName": "berdi",
    "description": "Search over 15,000 tables extracted from 38 pipeline applications and their Environmental and Socio-Economic Assessments - the start of something new, at the Canada Energy Regulator.",
    "char": {
      "colon": ":",
      "percent": "%"
    },
    "tables": "Tables",
    "figures": "Figures",
    "previous": "Previous",
    "download": "Download",
    "next": "Next",
    "fullProjectName": "Full Project Name: ",
    "applicationType": "Application Type: ",
    "commodity": "Commodity: ",
    "consultants": "ESA Consultant(s): ",
    "companyName": "Company Name: ",
    "hearingOrder": "Hearing Order: ",
    "filingDate": "Filing Date: ",
    "learnMethods": "Learn more about our methods.",
    "figureCount": "{figures, plural, =1 {figure} other {figures}}",
    "tableCount": "{tables, plural, =1 {table} other {tables}}",
    "a11y": {
      "header": "header background",
      "redirect": "redirect to page",
      "open": "open description dialog",
      "close": "close",
      "downloadReport": "download report"
    }
  },
  "components": {
    "accuracyAlert": {
      "title": "A NOTE ON ACCURACY",
      "body": "Results will be shown in the original language they were filed in. Results may be limited. Some data has been excluded."
    },
    "applicationDialog": {
      "regdocs": "View REGDOCS Folder",
      "tables": "Download ESA Tables"
    },
    "applications": {
      "title": "Click to view details on selected projects."
    },
    "betaAlert": {
      "title": "BETA",
      "body": "This site will change as we test ideas.",
      "link": "Learn how you can help."
    },
    "dropdown": {
      "APPLICATION_NAMES": "Project",
      "REGIONS": "Province",
      "STATUSES": "Pipeline status",
      "COMMODITIES": "Commodity",
      "CONTENT_TYPES": "Results type",
      "PROJECT_TYPES": "Project type (NEB Act)",
      "dateLabel": "Filing date",
      "all": "(All)",
      "multiple": "(Multiple selected)",
      "select": "- Select -",
      "tooltip": "This dataset is limited to projects falling under the former {nebAct}. The current {cerAct} has amended and added new categories of projects.",
      "nebAct": "NEB Act",
      "cerAct": "CER Act",
      "nebLink": "https://lois-laws.justice.gc.ca/eng/acts/N-7/",
      "cerLink": "https://laws-lois.justice.gc.ca/eng/acts/C-15.1/"
    },
    "errorBoundary": {
      "errorMessage": "Something went wrong.",
      "restoreLinkText": "Restore Session",
      "restoreMessage": "Please click on the link to restore the session:",
      "resetLinkText": "Reset Session",
      "resetMessage": "Please click on the link to reset the session:"
    },
    "limitationsDialog": {
      "title": "General Limitations",
      "close": "Close",
      "accuracy": {
        "title": "Accuracy",
        "body": "CSV table data is extracted according to the methods outlined in the Methodology Documentation and may contain some inaccuracies. Extracted data is limited to the data contained in the ESA that is filed for the first time in a specific Application to which that ESA applies. ESA-related information that is filed after that initial Application-specific ESA is filed is excluded from this collection. In the event of variance, the original PDF in REGDOCS is the main source. Data sources for ESA tables are cited at the discretion of those writing the ESAs and may vary according to ESA."
      },
      "termsTitle": {
        "title": "Terms and Conditions",
        "body": "Please refer to the CER website's {link} for limitations, which apply to this repository.",
        "link": "\"Terms and Conditions\"",
        "url": "https://www.cer-rec.gc.ca/en/terms-conditions.html"
      },
      "citation": {
        "title": "Citation",
        "body": "To cite this data bank, please use the following {cite} To cite individual data tables, please also cite the original ESA PDF in REGDOCS.",
        "cite": "Canada Energy Regulator (2020): Environmental and Socio-Economic Assessment Data Bank."
      },
      "dataSection": {
        "zipText": "You are about to download a ZIP package including the below:",
        "countsText": "{csvCount} CSV files ({tableCount} tables) {part2}",
        "countsPart2": "packaged in their respective Project folders, and including an index of tables",
        "limitationsText": "By downloading these files, you understand the above limitations and agree to adhere to all requirements.",
        "buttonLabel": "Download all tables "
      }
    },
    "searchPanel": {
      "exploreButton": "Explore all",
      "exploreLabel": "Explore results from:",
      "filterLabel": "Show filters",
      "searchButton": "Search",
      "searchLabel": "Find data:",
      "searchPlaceHolder": "Search by keyword(s)",
      "keywords": {}
    },
    "filterPanel": {
      "clearButton": "Clear all filters"
    },
    "treeMapPanel": {
      "title": "Search Results",
      "counts": "{tables, plural, =1 {1 table} other {# tables}} and {figures, plural, =1 {1 figure} other {# figures}} found",
      "boxSelect": "Select a box to filter by project and access project details.",
      "noResults": "Sorry, there are no results.",
      "noResultsFor": "Sorry, there are no results for {searches}.",
      "noResultsWithFilters": "Sorry, there are no results with these filters.",
      "noResultsForWithFilters": "Sorry, there are no results for {searches} with these filters.",
      "noResultsForWithDateRange": "Sorry, there are no results for {searches} within this date range.",
      "noResultsWithDateRange": "Sorry, there are no results within this date range."
    },
    "resultDialog": {
      "downloadTable": "Download table",
      "downloadFigure": "Download figure",
      "seeMore": "See more...",
      "seeLess": "See less...",
      "dataNotice": "We were unable to extract the table for download. Please view the original document.",
      "foundOnPage": "Found on page:",
      "originalPDF": "Original PDF:",
      "esaFolder": "ESA folder:",
      "projectFolder": "Project folder:",
      "finalDecision": "Final decision:",
      "failedToLoad": "Failed to load"
    },
    "resultsList": {
      "dataButton": {
        "label": "Access full dataset",
        "link": "csv/en/en.zip"
      },
      "titles": {
        "filedDate": "Project Filed Date"
      }
    },
    "loadingIndicator": {
      "api": "connecting",
      "app": "loading"
    },
    "unsupportedWarning": {
      "browser": "Your browser does not support the features required by this visualization.\nPlease use a recent version of Chrome, Firefox, Safari, or Edge.\nThank you!",
      "resolution": "This visualization has been designed for use on computers and tablets with a screen width of at least 768 pixels.\nThank you!"
    }
  },
  "pages": {
    "landing": {
      "taglineBold":"Learn from the past and prepare the future.",
      "tagline":"Search biophysical, economic, and regional data and information from 38 pipeline projects, since 2003.",
      "disclaimer": {
        "body": "Environmental and Socio-Economic Assessments cover many categories of “components” for assessment - including rare species, wetlands, and human health.",
        "button": "Read our disclaimer",
        "link": "Learn more about the data."
      },
      "discoveries": {
        "title": "Check out these cool discoveries",
        "accreditations": {
          "title": "Accreditations",
          "body": "From the Noun Project: aid by Scribble.liners; help by hafiudin; Risks by Ralf Schmitzer; Image by Flatart; Table by IconMark"
        },
        "cards": {
          "0": {
            "title": "Permafrost conditions",
            "body": "Permafrost from the Tundra in the Canadian North."
          },
          "1": {
            "title": "Raptor nests",
            "body": "Bird nests on a pipeline corridor in Saskatchewan."
          },
          "2": {
            "title": "Ditch fish",
            "body": "A fish species documented in a ditch near Camrose, Alberta."
          }
        }
      }
    },
    "project": {
      "title": "The project",
      "description": "The opportunity of a legacy, driven by policy - and our plans for the future.",
      "body": {
        "section1": {
          "header": "About the project",
          "boldText1": "Since 1965, the Canada Energy Regulator has collected thousands of documents from over 700 hearings all of which is available in our library.",
          "text1": "{boldText} With the introduction of REGDOCS in 2003, we have been digitizing thousands more. Among these documents are Environmental and Socio-Economic Assessments, or ESAs, where considerable data has been captured about public safety, species at risk, and environmental protection (such as water, soils and plants) to name a few.",
          "boldText2": "While this data is publicly available, it is not easily accessible and difficult to navigate.",
          "text2": "{boldText} Led by the Government of Canada’s Directive on Open Government, we endeavor to understand how best to mine, structure, and present regulatory data to the people we serve. This pilot project is our first step towards meeting that goal.",
          "boldText3": "This work is ongoing.",
          "text3": "{boldText} We will continue to experiment with ways to improve, structure, and explore regulatory data, using new datasets. To receive update notifications, follow us on Github."
        },
        "section2": {
          "header1": "Learn how you can help",
          "text1": "{toolName}, an Open Government initiative, was created to increase access and “unlock” historical data for the benefit of Canadians. Our first and most important step is to better understand the uses for this tool so we can create, validate, and prioritize features that improve this use. ",
          "text2": "If you work or have an interest in environmental research, environmental policy, or environmental and socio-economic data of any kind, we want to hear from you. ",
          "bold1": "Please email us with your feedback at {email}.",
          "email1": "data.donnees@cer-rec.gc.ca"
        }
      }
    },
    "data": {
      "title": "The data",
      "description": "An introduction to Environmental and Socio-Economic Assessments (\"ESA's\")",
      "body": {
        "title": "The data - baseline and effects from ESAs",
        "text1": "Data in this tool comes from Environmental and Socio-Economic Assessments (ESAs), which are reports filed with every application for a new pipeline. ESAs have been described as a “snapshot in time” because of their evolution throughout a hearing, so it is important to note that the ESAs we identified for data extraction are the original ESAs submitted by companies. More specifically from the Assessment and Abandonment stages, of both large and small projects, between the years 2003 and 2019.",
        "caption1": "ESAs are part of the application a company submits when proposing a pipeline. Once submitted, other people and organizations can provide their feedback. This feedback is reflected in other documents, like Information Requests (IRs), and written and oral comments. These documents may include other data, which are not included in this dataset.",
        "text2": "Two key pieces of information in an ESA are the {bold1} of the area where a pipeline is proposed, and the {bold2} of the proposed pipeline to that baseline.",
        "bold1": "baseline",
        "bold2": "effects",
        "header1": "Baseline Information",
        "text3": "Baseline information describes the current state of an area where a proposed pipeline might be built and may source from a combination of desktop and field research, or public engagement activities. This information includes a wide variety of topics, or “Valued Components,” which range from wetlands, species at risk and air emissions, to traditional land use, social and cultural well-being, and human health. The CER’s {link1} and {link2} provide details on the topics to consider, under biophysical and socio-economic categories.",
        "link1": "Filing Manual",
        "url1": "https://www.cer-rec.gc.ca/en/applications-hearings/submit-applications-documents/filing-manuals/filing-manual/filing-manual-guide-a-facilities-applications-a2.html",
        "link2": "Filing Manual Checklist",
        "url2": "https://www.cer-rec.gc.ca/en/applications-hearings/submit-applications-documents/filing-manuals/filing-manual/filing-manual-appendix-1-filing-manual-checklist.pdf",
        "header2": "Effects Analyses",
        "text4": "Effects analysis is used to predict the effects associated with a proposed project. Companies are required to propose mitigation measures they will undertake to sustain this baseline, like undertaking pre-construction surveys for nesting birds at certain time of the year to avoid interrupting bird nesting. These analyses also evaluate the potential impacts of a project once mitigation is applied, to assess the significance and likelihood of residual adverse environmental and socio-economic effects occurring. The level of detail required by the CER will vary with the nature and scale of the project.",
        "footer": "For a brief overview that details the environmental aspect of ESAs, view the Canada Energy Regulator’s {link}.",
        "link3": "video on Environmental Protection",
        "url3": "https://www.youtube.com/watch?v=cXLfhAI9hhw"
      }
    },
    "methods": {
      "title": "The methods",
      "description": "Learn how we turned regulatory documents into structured data.",
      "body": {
        "title": "Our Methods",
        "section1": {
          "paragraph1": "Environmental and Socio-Economic Assessments (ESAs) can be several hundred pages long and are submitted to the CER as a series of PDF documents. These PDFs contain qualitative and quantitative data, including text, tables, figures, maps and satellite images.",
          "paragraph2": "While the information contained in each ESA is comprehensive, it is not easily searchable or accessible due to the limitations of the PDF format. No raw data files, such as tables in CSV format, are filed with the CER -- all relevant information is contained within the PDF file. Those interested in analysing, comparing, or processing the data must extract it manually, by copying and pasting information from the PDF into other software programs, such as spreadsheet software. This is time-intensive and tedious.",
          "paragraph3": "A team of data scientists at the CER created the process for automatically identifying ESA table and figure titles and extracting table data as a CSV. This process uses several open-source libraries in the Python programming language. All code is open source and available on the {link}.",
          "link": "CER's GitHub repository",
          "url": "https://github.com/CER-REC/esa-data-bank_banque-donnees-ees"
        },
        "section2": {
          "header": "Step 1: Collect the relevant PDF documents",
          "paragraph1": "CER staff manually identified 1,902 ESA PDF documents in REGDOCS. {link1} is the CER's on-line repository of public documents related to the design, construction, operation, and abandonment of federally regulated pipelines. A file that indexes all of these documents is available in our {link2}.",
          "link1": "REGDOCS",
          "url1": "https://apps.cer-rec.gc.ca/REGDOCS/Home/Index",
          "link2": "CER's GitHub repository",
          "url2": "https://github.com/CER-REC/esa-data-bank_banque-donnees-ees"
        },
        "section3": {
          "header": "Step 2: Convert PDF documents to text files",
          "paragraph1": "Each PDF was converted into a more computer-friendly text format using the {link1}.",
          "link1": "Python Tika library",
          "url1": "https://github.com/chrismattmann/tika-python"
        },
        "section4": {
          "header": "Step 3: Extract tables and figures",
          "paragraph1": "The next step was to identify unique features of each PDF page and their location coordinates. This information allows users to identify pages that have image features (ex. size of blocks, presence of text, etc.) and is used in modeling to identify ESA Figures. The {link1} was used to extract these page-level PDF details.",
          "link1": "Python PyMuPDF library",
          "url1": "https://pymupdf.readthedocs.io/en/latest/",
          "paragraph2": "The extraction of tables from each PDF relied on a separate process. The {link2} was used to convert all tables from the PDFs into CSV (comma-separated value) files. Camelot relies on the presence of unique table features, (e.g. demarcated lines or presence of white space between cells) to identify tables in a PDF document. Once tables and figures were identified, the next task was to label them with their respective title.",
          "link2": "Python Camelot library",
          "url2": "https://camelot-py.readthedocs.io/en/master/"
        },
        "section5": {
          "header": "Step 4: Identify table and figure titles",
          "paragraph1": "The team used the ESA tables of contents from the PDF files (when available) together with a set of regular expressions to identify table and figure titles. Titles were then matched with their respective table or figure using regular expressions. In some instances, titles as they appear in the table of contents differed from the title spelling in the actual table or figure. Some calibration on matching was employed to match titles with figures or tables in such instances."
        },
        "section6": {
          "header": "Step 5: Validate and verify",
          "paragraph1": "In general, programming the extraction of data out of PDFs is an imperfect process because each PDF can contain different table formats and be prepared and saved using different techniques. For example, tables with clear, black borders are easier to extract accurately compared to tables that have unclear or no borders. Our team employed a manual validation process for a sample of the tables, figures, and PDFs. It is possible that there are tables in PDFs that were not extracted or tables that were extracted, but are missing some data. It is estimated that 94% to 98% of all tables in PDF have been extracted, and that 88% to 94% of all tables have complete data (based on a random sample of 384 tables). ",
          "paragraph2": {
            "part1": "As part of the quality assurance of the table extraction process, we found that 30 PDFs account for 84% of problematic extracted tables files. These files are concentrated in 5 projects (Towerbirch, Brunswick, Eastern Mainline, Wolverine, Leismer to Kettle River Crossover).",
            "table": {
              "title": "What does problematic mean?",
              "bullet1": "files only contain one column or one row;",
              "bullet2": "contains more than 72% blank cells;",
              "bullet3": "contains more than 80% cells with non-identified characters; or",
              "bullet4": "Two or more files are indexed with the same title and page, even though they are different."
            },
            "part2": "Tables belonging to these pdfs are indexed but not available to download in the current version. They will be incorporated in a later version."
          },
          "paragraph3": "All images were inspected and it was found that 92.1% of images had correct page numbers, 89.4% had correct titles, and 99.95% were faithful to the original image. Figure extraction was not perfect because of different titles for the same figure appearing in the table of contents vs. the body of text (due to spelling variability, inconsistency in labeling formats, or no title present). Secondly, figure titles that were embedded as images were undetected with a text-based extraction approach. Finally, in a small percentage of PDF files (0.95%), the extraction process led to corrupt images where the text/image blocks are partially retained and the rest of the figure is replaced by black colour.",
          "paragraph4": "While it is not a perfect process due to inconsistency in formatting, tables and figures can now be searched quickly, and tables can be downloaded in a machine-readable format - both possibilities that did not exist previously."
        },
        "section7": {
          "header": "Acknowledgements",
          "paragraph1": "The data science team at the University of British Columbia was instrumental in guiding this project in its early days. The Canada Energy Regulator acknowledges the work of Nipun Goyal, Louis (Xiang) Luo, and Prakhar Sinha (with support from Martha Essak, Erin Martin-Serrano, Stuart Donald, and Gene Moo Lee) at the {link1}, UBC Sauder School of Business. ",
          "link1": "Centre for Operations Excellence",
          "url1": "https://www.sauder.ubc.ca/thought-leadership/research-outreach-centres/centre-operations-excellence"
        }
      }
    },
    "back": "Back to {toolName}"
  }
}
