{
  "common": {
    "toolName": "Open Corridor",
    "description": "Search over 20,000 tables extracted from 37 pipeline applications and their Environmental and Socio-Econonmic Assesments - the start of something new, at the Canada Energy Regulator.",
    "char": {
      "colon": ":",
      "percent": "%"
    },
    "tables":"Tables",
    "figures":"Figures",
    "previous":"Previous",
    "download":"Download",
    "next":"Next",
    "fullProjectName":"Full Project Name",
    "applicationType":"Application Type",
    "commodity":"Commodity",
    "consultant":"Consultant",
    "companyName":"Company Name",
    "hearingOrder":"Hearing Order",
    "filingDate":"Filing Date",
    "a11y": {
      "header": "header background",
      "redirect": "redirect to page",
      "open": "open description dialog",
      "close": "close",
      "downloadReport": "download report"
    }
  },
  "dropdowns":{
    "REGIONS": "Province",
    "STATUSES": "Pipeline Status",
    "COMMODITIES": "Commodity",
    "PROJECT_TYPES": "Project Type (NEB Act)",
    "DATE": "Date project was filed"
  },
  "components": {
    "limitationsDialog": {
      "title": "General Limitations",
      "close": "Close",
      "accuracy": {
        "title": "Accuracy",
        "body": "CSV table data is extracted according to the methods outlined in the Methodology Documentation and may contain some inaccuracies. Extracted data is limited to the data contained in the ESA that is filed for the first time in a specific Application to which that ESA applies. ESA-related information that is filed after that initial Application-specific ESA is filed is excluded from this collection. In the event of variance, the original PDF in REGDOCS is the main source. Data sources for ESA tables are cited at the discretion of those writing the ESAs and may vary according to ESA."
      },
      "termsTitle": {
        "title": "Terms and Conditions",
        "body": "Please refer to the CER website's {link} for limitations, which apply to this repository.",
        "link": "\"Terms and Conditions\"",
        "url":"https://www.cer-rec.gc.ca/en/terms-conditions.html"
      },
      "citation": {
        "title": "Citation",
        "body": "To cite this data bank, please use the following {cite} To cite individual data tables, please also cite the original ESA PDF in REGDOCS.",
        "cite": "Canada Energy Regulator (2020): Environmental and Socio-Economic Assessment Data Bank."
      },
      "dataSection":{
        "zipText":"You are about to download a ZIP package including the below:",
        "countsText":"{csvCount} CSV files ({tableCount} tables) {part2}",
        "countsPart2":"packaged in their respective Application folders, and including an index of tables",
        "limitationsText":"By downloading these files, you understand the above limitations and agree to adhere to all requirements.",
        "buttonLabel":"Download all tables ",
        "url":"csv/en/en.zip"
      }
    },
    "searchPanel": {
      "exploreButton": "Explore Catalogue",
      "exploreLabel": "Explore results from:",
      "filterLabel": "Show filters",
      "searchButton": "Search",
      "searchLabel": "Find data:",
      "searchPlaceHolder": "Search by keyword(s)",
      "keywords": {}
    },
    "filterPanel":{
      "title":"Search by one or many of the filter options below.",
      "clearButton":"Clear all filters."
    },
    "treeMap":{
      "title":"Select a box to filter by project and access project details.",
      "REGDOCSButton":"View REGDOCS Folder",
      "tablesButton":"Download Project Tables"
    },
    "resultsList":{
      "dataButton":{
        "label":"Access Full Dataset",
        "link":"csv/en/en.zip"
      },
      "sortLabel":"Sort by data type",
      "downloadTable":"Download table",
      "downloadFigure":"Download figure",
      "seeMore":"See more...",
      "esaSectionTitle":"ESA Section",
      "figureOccursOnPage":"Figure occurs on page: ",
      "tableOccursOnPage":"Table occurs on page: ",
      "viewOriginalDocument":"View original document",
      "titles":{
        "fullProjectName":"Full Project Name",
        "filedDate":"Project Filed Date",
        "consultants":"ESA Consultant(s)"
      }
    },
    "loadingIndicator": {
      "api": "connecting",
      "app": "loading"
    },
    "unsupportedWarning": {
      "browser": "Your browser does not support the features required by this visualization.\nPlease use a recent version of Chrome, Firefox, Safari, or Edge.\nThank you!",
      "resolution": "This visualization has been designed for use on computers and tablets with a screen width of at least 768 pixels.\nThank you!"
    }
  },
  "pages": {
    "landing": {
      "alert": {
        "title": "BETA",
        "body": "This site will change as we test ideas.",
        "link": "Learn how you can help."
      },
      "disclaimer": {
        "body": "Environmental and Socio-Economic Assessments cover many categories of “components” for assessment - including rare species, wetlands, and human health.",
        "button": "Read Our Disclaimer",
        "link": "Learn more about the data."
      },
      "discoveries": {
        "title": "Check out these cool discoveries",
        "accreditations": {
          "title": "Accreditations",
          "body": "From the Noun Project: aid by Scribble.liners; help by hafiudin; Risks by Ralf Schmitzer; Image by Flatart"
        },
        "wetlands": {
          "title": "Unnamed Wetlands",
          "body": "Areas of land that may have never before been documented."
        },
        "nests": {
          "title": "Raptor nests",
          "body": "Bird nests that fall along a pipeline corridor."
        },
        "fish": {
          "title": "Ditch fish",
          "body": "A fish species documented in a tributary off the Fraser River."
        }
      }
    },
    "project":{
      "title":"The project",
      "description":"The opportunity of a legacy, driven by policy - and our plans for the future.",
      "body":{
        "header":"About the project",
        "boldText1":"Since 1965, the Canada Energy Regulator has collected thousands of documents from over 700 hearings all of which is available in our library.",
        "paragraph1":"{boldText} With the introduction of REGDOCS in 2003, we have been digitizing thousands more. Among these documents are Environmental and Socio-Economic Assessments, or ESAs, where considerable data has been captured about public safety, species at risk, and environmental protection (such as water, soils and plants) to name a few.",
        "boldText2":"While this data is publicly available, it is not easily accessible and difficult to navigate.",
        "paragraph2":"{boldText} Led by the Government of Canada’s Directive on Open Government, we endeavor to understand how best to mine, structure, and present regulatory data to the people we serve. This pilot project is our first step towards meeting that goal.",
        "boldText3":"This work is ongoing.",
        "paragraph3":"{boldText} We will continue to experiment with ways to improve, structure, and explore regulatory data, using new datasets. To receive update notifications, follow us on Github."
      },
      "help":{
        "title":"Learn how you can help",
        "text1":"{boldText}, an Open Government initiative, was created to increase access and “unlock” historical data for the benefit of Canadians. Our first and most important step is to better understand the uses for this tool so we can create, validate, and prioritize features that improve this use.",
        "text2":"If you work or have an interest in environmental research, environmental policy, or environmental and socio-economic data of any kind, we want to hear from you. {boldText}",
        "bold2":"Please email us with your feedback at {link}"
      }
    },
    "data":{
      "title":"The data",
      "description":"An introduction to Environmental and Socio-Economic Assessments (\"ESA's\")",
      "body":{
        "title":"The data - baseline and effects from ESAs",
        "text1":"Data in this tool comes from Environmental and Socio-Economic Assessments (ESAs), which are reports filed with every application for a new pipeline. ESA’s have been described as a “snapshot in time” because of their evolution throughout a hearing; so, it is important to note that the ESAs we identified for data extraction are the original ESAs submitted by companies. More specificially, from the Assessment and Abandonment stages, of both large and small projects, between the years 2003 and 2019.",
        "text2":"Two key pieces of information in an ESA regard the {bold1} of the area where a pipeline is proposed, and the {bold2} of the pipeline to that baseline.",
        "bold1":"baseline",
        "bold2":"effects",
        "header1":"Baseline Information",
        "text3":"Baseline information details the current state of an area where a proposed pipeline might be implemented and may source from a combination of desk and field research, or public engagement activities. This information includes a wide variety of topics, or “Valued Components,” which ranges from wetlands, species at risk, and air emissions, to traditional land use, social and cultural well-being, and human health. The Filing Manual details such topics to consider, under biophysical and socio-economic categories.",
        "header2":"(Proposed) Effects Analyses",
        "text4":"Effects analyses detail mitigation measures taken to sustain this baseline, like fencing at a certain time of year to avoid interrupting bird nesting seasons. These analyses also detail impact, or “Evaluation of Significance,” like how likely work camps are to impact communities.",
        "footer":"For a brief overview that details the environmental aspect of ESAs, view the Canada Energy Regulator’s {link}.",
        "linkLabel":"video on Environmental Protection"
      }
    },
    "methods":{
      "title":"The methods",
      "description":"Learn how we turned regulatory documents into structured data."
    },
    "back":"Back to {toolName}"
  }
}
